In [3]:
import pandas as pd
import numpy as np

In [ ]:
# created the sample dataset
data={
    'A':[1,2,100,4,5],
    'B': [3,np.nan,7,8,9],
    'C': [np.nan,12,13,14,15],
    'D':[16,17,18,np.nan,20]
}

In [5]:
# convert the dictionary to the pandas dataframe
df=pd.DataFrame(data)
print("Original Databframe : ")
print(df)

Original Databframe :
     A    B     C     D
0    1  3.0   NaN  16.0
1    2  NaN  12.0  17.0
2  100  7.0  13.0  18.0
3    4  8.0  14.0   NaN
4    5  9.0  15.0  20.0

In [8]:
df.isnull().sum()

A    0
B    1
C    1
D    1
dtype: int64

In [9]:
df.dropna()

     A    B     C     D
2  100  7.0  13.0  18.0
4    5  9.0  15.0  20.0

In [10]:
df.dropna(axis=1)

     A
0    1
1    2
2  100
3    4
4    5

In [16]:
# filling the missing value with the variables or number or median
df.B

0    3.0
1    NaN
2    7.0
3    8.0
4    9.0
Name: B, dtype: float64

In [12]:
df['B'].fillna(df['B'].mean())

0    3.00
1    6.75
2    7.00
3    8.00
4    9.00
Name: B, dtype: float64

In [13]:
df['B'].fillna(df['B'].median())

0    3.0
1    7.5
2    7.0
3    8.0
4    9.0
Name: B, dtype: float64

In [17]:
df['B'].fillna(50)

0     3.0
1    50.0
2     7.0
3     8.0
4     9.0
Name: B, dtype: float64

In [18]:
df['B'].fillna("Somethings")

0           3.0
1    Somethings
2           7.0
3           8.0
4           9.0
Name: B, dtype: object

In [19]:
# import seaborn
import seaborn as sns
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object